In [1]:
%config Completer.use_jedi = False
import numpy as np
import pandas as pd

In [6]:
#데이타 합치기:데이타가 여러 파일로 나눠 줬을때 합치는 경우
#시리즈 합치기
#1. pd.concat()- 시리즈를 수직 혹은 수평방향으로 합칠때 내지 데이타프레임을 수직으로 합칠때
mans = pd.Series(['shirts','pants','jacket'])
womans = pd.Series(['blouse','knit'])
cloths=pd.concat([mans,womans])
#cloths.index
cloths

0    shirts
1     pants
2    jacket
0    blouse
1      knit
dtype: object

In [7]:
cloths=pd.concat([mans,womans],axis=1)#첫번째 mans의 색인이 행인덱스가되고 두번째 womans의 색인이 컬럼인덱스가 된다(데이타 프레임)
cloths

        0       1
0  shirts  blouse
1   pants    knit
2  jacket     NaN

In [9]:
pd.concat([mans,womans],ignore_index=True)#각 시리즈의 기존 색인을 무시하고 순차적으로 색인을 생성하겠다

0    shirts
1     pants
2    jacket
3    blouse
4      knit
dtype: object

In [10]:
pd.concat([mans,womans],ignore_index=True,keys=['남성복','여성복'],names=['번호','옷'])#ignore_index=True와 함께쓰면 keys,name는 무시된다

0    shirts
1     pants
2    jacket
3    blouse
4      knit
dtype: object

In [11]:
pd.concat([mans,womans],keys=['남성복','여성복'],names=['번호','옷'])

번호   옷
남성복  0    shirts
     1     pants
     2    jacket
여성복  0    blouse
     1      knit
dtype: object

In [20]:
cloths=pd.concat([mans,womans],axis=1,keys=['남성복','여성복'],names=['번호'])#keys는 컬럼인덱스,names는 컬럼인덱스명이다
#axis=1일때는 names는 반드시 하나의 요소
print(cloths.columns)
print(cloths.columns.name)
print(cloths.index)
cloths

Index(['남성복', '여성복'], dtype='object', name='번호')
번호
RangeIndex(start=0, stop=3, step=1)

번호     남성복     여성복
0   shirts  blouse
1    pants    knit
2   jacket     NaN

In [25]:
#데이타 프레임 합치기
df1 = pd.DataFrame([['가길동',80],['나길동',99],['다길동',80]],columns=['names','score'])
df1_ = pd.DataFrame({'names':['라길동','마길동'],'score':[70,100]})
df1__ = pd.DataFrame({'names':['라길동','마길동'],'score':[70,100],'grade':['C','A']})
df1___ = pd.DataFrame({'major':['컴퓨터 공학','산업공학'],'years':[4,3]})

    major  years
0  컴퓨터 공학      4
1    산업공학      3

In [29]:
#수직으로 합치기(axis=0:디폴트)
pd.concat([df1,df1_],ignore_index=True)

  names  score
0   가길동     80
1   나길동     99
2   다길동     80
3   라길동     70
4   마길동    100

In [30]:
pd.concat([df1,df1__],ignore_index=True)#df1의 grade컬럼은 모두 NaN

  names  score grade
0   가길동     80   NaN
1   나길동     99   NaN
2   다길동     80   NaN
3   라길동     70     C
4   마길동    100     A

In [32]:
pd.concat([df1,df1__],ignore_index=True,join='outer')#join='outer'이 디폴트.일치하는 컬럼이 없더라도 다 합친다

  names  score grade
0   가길동     80   NaN
1   나길동     99   NaN
2   다길동     80   NaN
3   라길동     70     C
4   마길동    100     A

In [33]:
pd.concat([df1,df1__],ignore_index=True,join='inner')#일치하는 컬럼만 합친다

  names  score
0   가길동     80
1   나길동     99
2   다길동     80
3   라길동     70
4   마길동    100

In [35]:
pd.concat([df1,df1___],ignore_index=True,join='inner')#Empty Dataframe

True

In [39]:
pd.concat([df1,df1_],ignore_index=True,axis=1)#컬럼인덱스 RangeIndex롷 바뀌고 df1의 다길동이 있는 행은 df1_은 NaN

     0   1    2      3
0  가길동  80  라길동   70.0
1  나길동  99  마길동  100.0
2  다길동  80  NaN    NaN

In [41]:
pd.concat([df1,df1__],ignore_index=True,axis=1)

     0   1    2      3    4
0  가길동  80  라길동   70.0    C
1  나길동  99  마길동  100.0    A
2  다길동  80  NaN    NaN  NaN

In [46]:
pd.concat([df1,df1___],ignore_index=True,join='inner',axis=1)
#print(df1)
#print(df1___)

     0   1       2  3
0  가길동  80  컴퓨터 공학  4
1  나길동  99    산업공학  3

In [49]:
#2. df.merge()-데이타프레임을 수평으로 합칠때
#한 컬럼을 기준으로 합치는 함수로 SQL의 조인문과 같다
#※데이타프레임은 concat을 써서 수평으로 합치지 않는다
df1 = pd.DataFrame({'lkey':['foo','bar','baz','foo'],'value':[1,2,5,200]})
df2 = pd.DataFrame({'rkey':['foo','bar','baz','foo'],'value':[5,6,7,8]})
print(df1)
print(df2)
df1.merge(df2)#value컬럼을 기준으로 inner조인한다 즉 value컬럼의 값이 같은 행만 수평으로 합친다

  lkey  value
0  foo      1
1  bar      2
2  baz      5
3  foo    200
  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

  lkey  value rkey
0  baz      5  foo

In [51]:
#df1.merge(df2,left_on='lkey')#MergeError: Must pass "right_on" OR "right_index".
df1.merge(df2,left_on='lkey',right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo      200  foo        5
3  foo      200  foo        8
4  bar        2  bar        6
5  baz        5  baz        7